//Задача 1: Напишите программу, которая принимает на вход число и проверяет, 
//кратно ли оно одновременно 7 и 23.
int Number = 161;
if ( Number % 7 ==0 && Number % 23 ==0)
{
    Console.WriteLine ($" число {Number} кратно 7 и 23");
}